{"_id":{"$oid":"62213c5d0483ac9adaa6751c"},"Title":"Lord of the Rings: The Fellowship of the Rings","Description":"The future of civilization rests in the fate of the One Ring, which has been lost for centuries. Powerful forces are unrelenting in their search for it. But fate has placed it in the hands of a young Hobbit named Frodo Baggins (Elijah Wood), who inherits the Ring and steps into legend. A daunting task lies ahead for Frodo when he becomes the Ringbearer - to destroy the One Ring in the fires of Mount Doom where it was forged.","Genre":{"Name":"Fantasy","Description":"Should contain numerous consecutive scenes of characters portrayed to effect a magical and/or mystical narrative throughout the title. Usually has elements of magic, supernatural events, mythology, folklore, or exotic fantasy worlds.Note: not to be confused with Sci-Fi which is not usually based in magic or mysticism. Subjective."},"Director":{"Name":"Peter Jackson","Bio":"Though he began his career making gory and often witty horror comedies in his native New Zealand, director Peter Jackson went on to become one of the most successful and innovative filmmakers of his generation."},"Actors":[],"ImagePath":"https://flxt.tmsimg.com/assets/p28828_p_v10_am.jpg","__v":0}
{"_id":{"$oid":"62213ce80483ac9adaa6751f"},"Title":"Lord of the Rings: The Return of the King","Description":"The culmination of nearly 10 years work and conclusion to Peter Jacksons epic trilogy based on the timeless J.R.R. Tolkien classic, The Lord of the Rings: The Return of the King presents the final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Hobbits Frodo and Sam reach Mordor in their quest to destroy the one ring, while Aragorn leads the forces of good against Saurons evil army at the stone city of Minas Tirith.","Genre":{"Name":"Fantasy","Description":"Should contain numerous consecutive scenes of characters portrayed to effect a magical and/or mystical narrative throughout the title. Usually has elements of magic, supernatural events, mythology, folklore, or exotic fantasy worlds.Note: not to be confused with Sci-Fi which is not usually based in magic or mysticism. Subjective."},"Director":{"Name":"Peter Jackson","Bio":"Though he began his career making gory and often witty horror comedies in his native New Zealand, director Peter Jackson went on to become one of the most successful and innovative filmmakers of his generation."},"Actors":[],"ImagePath":"https://resizing.flixster.com/vrrHIh0u9hLunPkFiPOTfcuEp7A=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzL2VlYjJiYjBmLWMzMTgtNDBlMC1hZmQ3LTQ2ZTZlNmRlYjk3OS53ZWJw","__v":0}
{"_id":{"$oid":"62213dd80483ac9adaa67522"},"Title":"A Star is Born","Description":"Seasoned musician Jackson Maine discovers -- and falls in love with -- struggling artist Ally. She has just about given up on her dream to make it big as a singer until Jackson coaxes her into the spotlight. But even as Allys career takes off, the personal side of their relationship is breaking down, as Jackson fights an ongoing battle with his own internal demons.","Genre":{"Name":"Drama","Description":"Should contain numerous consecutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama. Subjective."},"Director":{"Name":"Bradly Copper","Bio":"Handsome and irreverently funny, Bradley Coopers combination of romantic leading man and hilarious character actor chops helped him progress from TV guest spots to memorable parts in features in a relatively short amount of time."},"Actors":[],"ImagePath":"https://flxt.tmsimg.com/assets/p28828_p_v10_am.jpg","__v":0}
{"_id":{"$oid":"62213ef00483ac9adaa67525"},"Title":"Jojo Rabbit","Description":"Jojo is a lonely German boy who discovers that his single mother is hiding a Jewish girl in their attic. Aided only by his imaginary friend -- Adolf Hitler -- Jojo must confront his blind nationalism as World War II continues to rage on.","Genre":{"Name":"Comedy","Description":"Virtually all scenes should contain characters participating in humorous or comedic experiences. The comedy can be exclusively for the viewer, at the expense of the characters in the title, or be shared with them. Please submit qualifying keywords to better describe the humor (i.e. spoof, parody, irony, slapstick, satire, black-comedy etc). If the title does not conform to the 'virtually all scenes' guideline then please do not add the comedy genre; instead, submit the same keyword variations described above to signify the comedic elements of the title. Subjective."},"Director":{"Name":"Taika Waititi","Bio":"Kiwi filmmaker Taika Waititis gift for uproarious and absurd humor served him well as director on such films as What We Do in the Shadows (2014), Hunt for the Wilderpeople (2016) and Thor: Ragnarok (2017), which freely mixed humor with horror, action-adventure and other genres."},"Actors":[],"ImagePath":"https://resizing.flixster.com/lDGCa9Mn_jFWxyjDXI9fZlRB04A=/ems.ZW1zLXByZC1hc3NldHMvbW92aWVzL2Q4Y2Q4MDVlLWFlMjAtNDg3MS04MTgyLWYwNWY0NmMxMTgwMy53ZWJw","__v":0}
{"_id":{"$oid":"62213fa60483ac9adaa67528"},"Title":"Grand Budapest Hotel","Description":"In the 1930s, the Grand Budapest Hotel is a popular European ski resort, presided over by concierge Gustave H. (Ralph Fiennes). Zero, a junior lobby boy, becomes Gustaves friend and protege. Gustave prides himself on providing first-class service to the hotels guests, including satisfying the sexual needs of the many elderly women who stay there. When one of Gustaves lovers dies mysteriously, Gustave finds himself the recipient of a priceless painting and the chief suspect in her murder.","Genre":{"Name":"Comedy","Description":"Virtually all scenes should contain characters participating in humorous or comedic experiences. The comedy can be exclusively for the viewer, at the expense of the characters in the title, or be shared with them. Please submit qualifying keywords to better describe the humor (i.e. spoof, parody, irony, slapstick, satire, black-comedy etc). If the title does not conform to the 'virtually all scenes' guideline then please do not add the comedy genre; instead, submit the same keyword variations described above to signify the comedic elements of the title. Subjective."},"Director":{"Name":"Wes Anderson","Bio":"Noted for droll comedies that ruminated on loss, parental abandonment and sibling rivalry, director Wes Anderson emerged onto the filmmaking scene with the ultra-low budget Bottle Rocket (1996), which earned him considerable attention inside the industry and drew immediate comparisons to auteurs like Woody Allen and Jean Renoir."},"Actors":[],"ImagePath":"https://www.rottentomatoes.com/m/the_grand_budapest_hotel/pictures","__v":0}
{"_id":{"$oid":"622140610483ac9adaa6752b"},"Title":"Black Hawk Down","Description":"The film takes place in 1993 when the U.S. sent special forces into Somalia to destabilize the government and bring food and humanitarian aid to the starving population. Using Black Hawk helicopters to lower the soldiers onto the ground, an unexpected attack by Somalian forces brings two of the helicopters down immediately. From there, the U.S. soldiers must struggle to regain their balance while enduring heavy gunfire.","Genre":{"Name":"War","Description":"Should contain numerous scenes and/or a narrative that pertains to a real war (i.e., past or current). Note: for titles that portray fictional war, please submit it as a keyword only. Objective."},"Director":{"Name":"Ridley Scott","Bio":"One of the more respected and prolific filmmakers in modern cinema, director-producer Ridley Scott amassed a portfolio containing some of the most critically and commercially successful movies of all time."},"Actors":[],"ImagePath":"https://www.rottentomatoes.com/m/black_hawk_down/pictures","__v":0}
{"_id":{"$oid":"6221414d0483ac9adaa6752e"},"Title":"Don't Look Up","Description":"Kate Dibiasky (Jennifer Lawrence), an astronomy grad student, and her professor Dr. Randall Mindy (Leonardo DiCaprio) make an astounding discovery of a comet orbiting within the solar system. The problem: its on a direct collision course with Earth. The other problem? No one really seems to care. Turns out warning mankind about a planet-killer the size of Mount Everest is an inconvenient fact to navigate. With the help of Dr. Oglethorpe (Rob Morgan), Kate and Randall embark on a media tour that takes them from the office of an indifferent President Orlean (Meryl Streep) and her sycophantic son and Chief of Staff, Jason (Jonah Hill), to the airwaves of The Daily Rip, an upbeat morning show hosted by Brie (Cate Blanchett) and Jack (Tyler Perry). With only six months until the comet makes impact, managing the 24-hour news cycle and gaining the attention of the social media obsessed public before its too late proves shockingly comical -- what will it take to get the world to just look up?!","Genre":{"Name":"Comedy","Description":"Virtually all scenes should contain characters participating in humorous or comedic experiences. The comedy can be exclusively for the viewer, at the expense of the characters in the title, or be shared with them. Please submit qualifying keywords to better describe the humor (i.e. spoof, parody, irony, slapstick, satire, black-comedy etc). If the title does not conform to the 'virtually all scenes' guideline then please do not add the comedy genre; instead, submit the same keyword variations described above to signify the comedic elements of the title. Subjective."},"Director":{"Name":"Adam Mckay","Bio":"Is an American film director, producer, screenwriter and comedian. McKay began his career in the 1990s as a head writer for the NBC sketch comedy show Saturday Night Live"},"Actors":[],"ImagePath":"https://www.rottentomatoes.com/m/dont_look_up_2021/pictures","__v":0}
{"_id":{"$oid":"622142690483ac9adaa67531"},"Title":"Rogue One: A Star Wars Story","Description":"Former scientist Galen Erso lives on a farm with his wife and young daughter, Jyn. His peaceful existence comes crashing down when the evil Orson Krennic takes him away from his beloved family. Many years later, Galen becomes the Empires lead engineer for the most powerful weapon in the galaxy, the Death Star. Knowing that her father holds the key to its destruction, Jyn joins forces with a spy and other resistance fighters to steal the space stations plans for the Rebel Alliance.","Genre":{"Name":"Sci-Fi","Description":"Numerous scenes, and/or the entire background for the setting of the narrative, should be based on speculative scientific discoveries or developments, environmental changes, space travel, or life on other planets. Subjective."},"Director":{"Name":"Gareth Edwards","Bio":"Gareth Edwards was a British visual effects designer and film director whose talent for destructive set pieces were tailor-made for such blockbuster films such as Monsters (2010) and Godzilla (2014)."},"Actors":[],"ImagePath":"https://www.rottentomatoes.com/m/rogue_one_a_star_wars_story/pictures","__v":0}
{"_id":{"$oid":"622143300483ac9adaa67534"},"Title":"Saving Private Ryan","Description":"Captain John Miller (Tom Hanks) takes his men behind enemy lines to find Private James Ryan, whose three brothers have been killed in combat. Surrounded by the brutal realties of war, while searching for Ryan, each man embarks upon a personal journey and discovers their own strength to triumph over an uncertain future with honor, decency and courage.","Genre":{"Name":"War","Description":"Should contain numerous scenes and/or a narrative that pertains to a real war (i.e., past or current). Note: for titles that portray fictional war, please submit it as a keyword only. Objective."},"Director":{"Name":"Steven Spielberg","Bio":"Steven Spielberg was an iconic American filmmaker whose wide body of work was thoroughly embraced by both mainstream audiences and critics throughout his long and prolific career."},"Actors":[],"ImagePath":"https://www.rottentomatoes.com/m/saving_private_ryan/pictures","__v":0}
{"_id":{"$oid":"622143f30483ac9adaa67537"},"Title":"Flight","Description":"Commercial airline pilot Whip Whitaker (Denzel Washington) has a problem with drugs and alcohol, though so far hes managed to complete his flights safely. His luck runs out when a disastrous mechanical malfunction sends his plane hurtling toward the ground. Whip pulls off a miraculous crash-landing that results in only six lives lost. Shaken to the core, Whip vows to get sober -- but when the crash investigation exposes his addiction, he finds himself in an even worse situation.","Genre":{"Name":"Drama","Description":"Should contain numerous consecutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama. Subjective."},"Director":{"Name":"Robert Zemeckis","Bio":"Filmmaker Robert Zemeckis created popular fare, frequently using the latest technology, that left an indelible mark on the entertainment industry."},"Actors":[],"ImagePath":"https://flxt.tmsimg.com/assets/p9253979_v_v10_az.jpg","__v":0}
{"_id":{"$oid":"6221471a56d89fa97aec9acf"},"Title":"Test","Description":"abc","Genre":{"Name":"Drama","Description":"Should contain numerous consecutive scenes of characters portrayed to effect a serious narrative throughout the title, usually involving conflicts and emotions. This can be exaggerated upon to produce melodrama. Subjective."},"Director":{"Name":"Robert Zemeckis","Bio":"Filmmaker Robert Zemeckis created popular fare, frequently using the latest technology, that left an indelible mark on the entertainment industry."},"Actors":["Mike Morand","Mike Jordan"],"ImagePath":"https://flxt.tmsimg.com/assets/p9253979_v_v10_az.jpg","__v":0}
